<?php


namespace App\Constants;


class UserRole extends AbstractConstants
{
    const SUPERADMIN = 0; //Главный администратор
    const ADMIN = 1; //Администратор
    const CONTENT = 2; //Контент менеджер
    const MODERATOR = 3; //Модератор
    const ACCOUNTANT = 4; //Бухгалтер
    const SYSTEMADMIN = 5; //Системный администратор
    const SPONSOR = 6; //Пользователь как Спонсор
    const USER = 7; //Пользователь?*
}
/**
 * @constant SUPERADMIN 0
 * Գլխավոր ադմինիստրատոր
 * -
 * Հասանելիություն ունի ադմինիստրացիոն համակարգի առանց բացառության բոլոր գործիքներին և ֆունկցիաներին։
 * Կարող է ավելացնել նոր ադմինների, արգելափակել կամ ջնջել նրանց:
 */

/**
 * @constant ADMIN 1
 * Ադմինիստրատոր
 * -
 * Հասանելիություն ունի ադմինիստրացիոն համակարգի բոլոր գործիքներին և ֆունկցիաներին,
 * բացի ադմինների ցանկը և տվյալները տեսնելու, ադմիններ ավելացնելու, արգելափակելու և ջնջելու հնարավորությունից։
 */

/**
 * @constant CONTENT 2
 * Կոնտենտ մենեջեր
 * -
 * Հասանելիություն ունի ադմինիստրացիոն համակարգի կոնտենտային մասին,
 * կարող է խմբագրել ցանկացած բաժնի կամ էջի տեքստերը կամ նկարները։
 *
 * Հասանելիություն չունի երեխաների կամ հովանավորների բազաներին, դրամահավաքների կամ արշավներ ստեղծելու գործիքներին,
 * հովանավորների գործողությունների վերահսկման գործքիներին, ֆինանսական շարժերի կամ այլ հաշվետվություններին։
 */

/**
 * @constant MODERATOR 3
 * Մոդերատոր
 * -
 * Հասանելիություն ունի բոլոր օգտատերերի բազաներին և գործողություններին։
 * Կառավարում է վճարումները, կարողանում է անջատել պարբերական վճարումները, տեսնում է հաշվետվությունները:
 */

/**
 * @constant ACCOUNTANT 4
 * Հաշվապահ
 * -
 * Հասանելիություն ունի բոլոր հաշվետվություններին և ստատիստիկաներին։
 */

/**
 * @constant SYSTEMADMIN 5
 * Սիս ադմին
 * -
 * Կառավարում է ադմինիստրացիոն համակարգ մուտքի հնարավորություն ունեցող ip-ների ցանկը։
 * Ավելացնում կամ հեռացնում է հասցեները, տեսնում է ադմինների վերջին մուտքի օրը և ժամը։
 */

/**
 * @constant SPONSOR 6
 */

/**
 * @constant USER 6
 */
