<?php
return [
    'welcome' => 'Բարի գալուստ էլիտար մերսման սրահ',
    'services' => 'Մեր ծառայությունները',
    'relax' => 'ԱՄՐԱԳԵՔ և ԶԳԱՑԵՔ ՄԵՐ ԱՆՀԱՎԱՆԱԿԱՆ ՍՊԱ ՓՈՐՁԸ',
    'masseuses' => 'Մեր մերսուհիները',
    'help' => 'Մենք կօգնենք ձեզ հանգստանալ',
    'Contact us' => 'Կապ',
    'faq' => 'Հաճախ տրվող հարցեր',
    'gallery' => 'դուք կարող եք տեսնել մեր լուսանկարների պատկերասրահը',
    'salary' => 'Աշխատավարձ',
    'more' => 'Ավելի մանրամասն',
    'price' => 'Ծառայություններ և գներ',
    'book' => 'Ուղարկել հայտ',
    'procedurePrice' => 'Ծառայության գինը',
    'show_price' => 'Դիտել գները' ,
    'working time' => 'Աշխ․ Ժամեր',
    'working day' => 'Երկ-ՈՒրբ',
];
